<!DOCTYPE html>
<html lang=zh>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="renderer" content="webkit">
  <meta http-equiv="Cache-Control" content="no-transform" />
  <meta http-equiv="Cache-Control" content="no-siteapp" />
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">
  <meta name="format-detection" content="telephone=no,email=no,adress=no">
  <!-- Color theme for statusbar -->
  <meta name="theme-color" content="#000000" />
  <!-- 强制页面在当前窗口以独立页面显示,防止别人在框架里调用页面 -->
  <meta http-equiv="window-target" content="_top" />
  
  
  <title>APC详细分析 | Airshelf&#39;s blog</title>
  <meta name="description" content="APC概念APC分为两种类型：内核APC、用户APC 用户模式APC运行在用户模式下的目标线程的当前上下文中，且需要获得目标线程的许可。 用户模式APC需要在目标线程处于alertable的等待状态才能被成功调度执行。 通过调度下面的任一函数，都可以让线程进入这种等待状态。 内核函数： KeWaitForSingleObject KeWaitForMultipleObjects KeWaitFor">
<meta property="og:type" content="article">
<meta property="og:title" content="APC详细分析">
<meta property="og:url" content="http://airshelf.github.io/2021/08/11/APC-detail/index.html">
<meta property="og:site_name" content="Airshelf&#39;s Blog">

		<span class="post-wordcount hidden-xs" itemprop="wordCount">字数统计: 5k(字)</span>
	
	
		<span class="post-readcount hidden-xs" itemprop="timeRequired">阅读时长: 21(分)</span>
	

      </div>
    </div>
    <div class="article-entry marked-body" itemprop="articleBody">
      
        <h3 id="APC概念"><a href="#APC概念" class="headerlink" title="APC概念"></a>APC概念</h3><p>APC分为两种类型：内核APC、用户APC</p>
<p>用户模式APC运行在用户模式下的目标线程的当前上下文中，且需要获得目标线程的许可。</p>
<p>用户模式APC需要在目标线程处于alertable的等待状态才能被成功调度执行。</p>
<p>通过调度下面的任一函数，都可以让线程进入这种等待状态。</p>
<p>内核函数：</p>
<pre class="line-numbers language-c"><code class="language-c">KeWaitForSingleObject
KeWaitForMultipleObjects
KeWaitForMutexObject
KeDelayExecutionThread
<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span></span></code></pre>
<p>用户函数：</p>
<pre class="line-numbers language-c"><code class="language-c">SleepEx
SignalObjectAndWait
WaitForSingleObjectEx 
WaitForMultipleObjectsEx
MsgWaitForMultipleObjectsEx
<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p>此外,通过调用一个未公开的alert-test服务<code>KeTestAlertThread</code>，用户线程可以使用户模式APC执行。</p>
<h3 id="APC相关结构"><a href="#APC相关结构" class="headerlink" title="APC相关结构"></a>APC相关结构</h3><p>每一个线程都包含两个APC队列，一个为用户APC队列、一个为内核APC队列。这两个队列都存储在<code>_KAPC_STATE</code>结构体中。</p>
<pre class="line-numbers language-c"><code class="language-c"><span class="token keyword">typedef</span> <span class="token keyword">struct</span> _KAPC_STATE <span class="token punctuation">{</span>
        LIST_ENTRY ApcListHead<span class="token punctuation">[</span>MaximumMode<span class="token punctuation">]</span><span class="token punctuation">;</span>       <span class="token comment" spellcheck="true">//线程的apc链表 只有两个 内核态和用户态</span>
        <span class="token keyword">struct</span> _KPROCESS <span class="token operator">*</span>Process<span class="token punctuation">;</span>               <span class="token comment" spellcheck="true">//当前线程的进程体   PsGetCurrentProcess()</span>
        BOOLEAN KernelApcInProgress<span class="token punctuation">;</span>              <span class="token comment" spellcheck="true">//内核APC正在执行</span>
        BOOLEAN KernelApcPending<span class="token punctuation">;</span>                 <span class="token comment" spellcheck="true">//内核APC正在等待执行</span>
        BOOLEAN UserApcPending<span class="token punctuation">;</span>                  <span class="token comment" spellcheck="true">//用户APC正在等待执行</span>
<span class="token punctuation">}</span> KAPC_STATE<span class="token punctuation">,</span> <span class="token operator">*</span>PKAPC_STATE<span class="token punctuation">,</span> <span class="token operator">*</span>PRKAPC_STATE<span class="token punctuation">;</span>
<span aria-hidden="true" class="line-numbers-rows"><span></span><span></span><span></span><span></span><span></span><span></span><span></span></span></code></pre>
<p><code>_KPAC_STATE</code>结构体又存储于<code>_KTHREAD</code>中</p>
<pre><code>ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x010 MutantListHead   : _LIST_ENTRY
   +0x018 InitialStack     : Ptr32 Void
   +0x01c StackLimit       : Ptr32 Void
   +0x020 Teb              : Ptr32 Void
   +0x024 TlsArray         : Ptr32 Void
   +0x028 KernelStack      : Ptr32 Void
   +0x02c DebugActive      : UChar
   +0x02d State            : UChar
   +0x02e Alerted          : [2] UChar
   +0x030 Iopl             : UChar
   +0x031 NpxState         : UChar
   +0x032 Saturation       : Char
   +0x033 Priority         : Char
   +0x034 ApcState         : _KAPC_STATE          //这里保存_KAPC_STATE 
   +0x04c ContextSwitches : Uint4B
   ...
   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME
   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE //
　 +0x140 PreviousMode     : Char
   +0x141 EnableStackSwap  : UChar
   +0x142 LargeStack       : UChar
   +0x143 ResourceIndex    : UChar
   +0x144 KernelTime       : Uint4B
   +0x148 UserTime         : Uint4B
   +0x14c SavedApcState    : _KAPC_STATE          //这里保存_KAPC_STATE 
   +0x164 Alertable        : UChar
   +0x165 ApcStateIndex    : UChar                //
</code></pre>
<p>没有附加时，ApcState存储当前进程的APC队列<br>当A进程附加到B进程，SaveApcState保存原来A进程的Apc队列，ApcState保存被附加B进程的Apc队列。</p>
<p>在_KTHREAD中，</p>
<pre class="line-numbers language-c"><code class="language-c"><span class="token keyword">typedef</span> <span class="token keyword">enum</span> _KAPC_ENVIRONMENT <span class="token punctuation">{</span>
　　OriginalApcEnvironment<span class="token punctuation">,</span> <span class="token comment" spellcheck="true">//原始的进程环境</span>
　　AttachedApcEnvironment<span class="token punctuation">,</span> <span class="token comment" spellcheck="true">//挂靠后的进程环境</span>
　　CurrentApcEnvironment<span class="token punctuation">,</span> <span class="token comment" spellcheck="true">// 当前环境</span>
 　 InsertApcEnvironment   <span class="token comment" spellcheck="true">//被插入时的环境</span>
<span class="token punctuation">}</span> KAPC_ENVIRONMENT<span class="token punctuation">;</span>
